---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailableForSwitchPanel
source: html/08f088c1-0942-416f-6f29-f11a65065f20.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailableForSwitchPanel Property

There aren't enough space on switchboard [Panel Name], so the circuit will connect through Feed Through Lugs.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailableForSwitchPanel { get; }
```